Reports/ДневнойОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ДневнойОтчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьНаЭлектроннуюПочту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>мТекущаяНастройка</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокКонтрагентов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КатегорииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыФайловРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыФайловРассылок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>TXT</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CSV</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XLSx</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ДневнойОтчет/Ext/ObjectModule.bsl
Процедура ВыполнитьРаботу(Интерактивно = Ложь) Экспорт 
	
	Если Не ЗначениеЗаполнено(ДатаОтчета) Тогда 
		ДатаОтчета = ТекущаяДата();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Константы.ГруппаMILES.Получить()) Тогда 
		
		ТекстСообщения = "Не заполнена константа 'Группа MILES'!";
		
		#Если Клиент Тогда
			Сообщить(ТекстСообщения, СтатусСообщения.Важное);
		#Иначе
			ЗаписьЖурналаРегистрации("РассылкаДневногоОтчета", УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
		#КонецЕсли
		
		Возврат;
		
	КонецЕсли;	
	
	ОсновнойСклад = Константы.ОсновнойСклад.Получить();
	
	Если ОтправлятьНаЭлектроннуюПочту Тогда 	
		
		УчетнаяЗаписьЭлектроннойПочты = Константы.ОсновнаяУчетнаяЗаписьЭлектроннойПочты.Получить();
		
		Если НЕ ЗначениеЗаполнено(УчетнаяЗаписьЭлектроннойПочты) Тогда 
			
			ТекстСообщения = "Не заполнена константа основной записи электронной почты!";
			
			#Если Клиент Тогда
				Сообщить(ТекстСообщения, СтатусСообщения.Важное);
			#Иначе
				ЗаписьЖурналаРегистрации("РассылкаДневногоОтчета", УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
			#КонецЕсли
			
			Возврат;
			
		КонецЕсли;		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК КонтрагентСсылка,
		|	ЕСТЬNULL(КонтактнаяИнформация.Представление, """") КАК АдресЭлектроннойПочтыПользователяДляРассылкиОтчета
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
		|			ПО КонтактнаяИнформация.Объект = КатегорииОбъектов.Объект
		|				И (КатегорииОбъектов.Категория = ЗНАЧЕНИЕ(Справочник.КатегорииОбъектов.ОтправлятьДневнойОтчет))
		|		ПО (КонтактнаяИнформация.Объект = Пользователи.ФизЛицо.Ссылка)
		|			И (КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
		|			И (КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailРабочийФизическогоЛица))
		|ГДЕ
		|	(ВЫРАЗИТЬ(ЕСТЬNULL(КонтактнаяИнформация.Представление, """""""") КАК СТРОКА(200))) <> """"""""";
		
		ТаблицаЭлектронныхАдресовДляОтправки = Запрос.Выполнить().Выгрузить();
		
		Если Не Интерактивно И ТаблицаЭлектронныхАдресовДляОтправки.Количество() = 0 Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	//Марков И. 10.07.2024 #UT10-4592 Изменен параметр отбора СборкаЗаказовПокупателя с "Дата" на "ВремяОкончанияСборки"
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыНаСкладахОстатки.Номенклатура), 0) КАК КоличествоРазличныхАртикуловНаКонецДня
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&Д, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РазмещениеПоЯчейкамТовары.НомерСтроки), 0) КАК КоличествоПринятоПаллета
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|	И РазмещениеПоЯчейкамТовары.Ссылка.ПалетноеХранение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РазмещениеПоЯчейкамТовары.НомерСтроки), 0) КАК КоличествоПринятоНЕПаллета
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам.Товары КАК РазмещениеПоЯчейкамТовары
	|ГДЕ
	|	РазмещениеПоЯчейкамТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И РазмещениеПоЯчейкамТовары.Ссылка.Проведен
	|	И НЕ РазмещениеПоЯчейкамТовары.Ссылка.ПалетноеХранение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ПеремещениеТовараПоЯчейкамТовары.НомерСтроки), 0) КАК КоличествоСтрокПеремещено
	|ИЗ
	|	Документ.ПеремещениеТовараПоЯчейкам.Товары КАК ПеремещениеТовараПоЯчейкамТовары
	|ГДЕ
	|	ПеремещениеТовараПоЯчейкамТовары.Ссылка.Проведен
	|	И ПеремещениеТовараПоЯчейкамТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(СборкаЗаказовПокупателяЗаказано.НомерСтроки), 0) КАК КоличествоНеСобрано
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка.Проведен
	|	И СборкаЗаказовПокупателяЗаказано.Ссылка.ВремяОкончанияСборки МЕЖДУ &Дата1 И &Дата2
	|	И СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВЫБОР
	|			КОГДА КорректировкаСборкиЗаказовПокупателяТовары.Ячейка = &ЯчейкаДоВыяснения
	|				ТОГДА КОЛИЧЕСТВО(КорректировкаСборкиЗаказовПокупателяТовары.НомерСтроки)
	|			ИНАЧЕ 0
	|		КОНЕЦ, 0) КАК КоличествоСборокВЯчейку_ДоВыяснения
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя.Товары КАК КорректировкаСборкиЗаказовПокупателяТовары
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателяТовары.Ссылка.Проведен
	|	И КорректировкаСборкиЗаказовПокупателяТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И КорректировкаСборкиЗаказовПокупателяТовары.Ячейка = &ЯчейкаДоВыяснения
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаСборкиЗаказовПокупателяТовары.Ячейка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СборкаЗаказовПокупателя.Ответственный
	|ПОМЕСТИТЬ ВТ_Ответственные
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя КАК СборкаЗаказовПокупателя
	|ГДЕ
	|	СборкаЗаказовПокупателя.Проведен
	|	И СборкаЗаказовПокупателя.ВремяОкончанияСборки МЕЖДУ &Дата1 И &Дата2
	|	И СборкаЗаказовПокупателя.Ответственный <> &ПустойОтветственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПеремещениеТовараПоЯчейкам.Ответственный
	|ИЗ
	|	Документ.ПеремещениеТовараПоЯчейкам КАК ПеремещениеТовараПоЯчейкам
	|ГДЕ
	|	ПеремещениеТовараПоЯчейкам.Проведен
	|	И ПеремещениеТовараПоЯчейкам.Дата МЕЖДУ &Дата1 И &Дата2
	|	И ПеремещениеТовараПоЯчейкам.Ответственный <> &ПустойОтветственный
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РазмещениеПоЯчейкам.Ответственный
	|ИЗ
	|	Документ.РазмещениеПоЯчейкам КАК РазмещениеПоЯчейкам
	|ГДЕ
	|	РазмещениеПоЯчейкам.Дата МЕЖДУ &Дата1 И &Дата2
	|	И РазмещениеПоЯчейкам.Проведен
	|	И РазмещениеПоЯчейкам.Ответственный <> &ПустойОтветственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Ответственные.Ответственный) КАК КоличествоОтветственных
	|ИЗ
	|	ВТ_Ответственные КАК ВТ_Ответственные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Контрагент
	|ПОМЕСТИТЬ ВТ_Грузополучатели
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &Дата1 И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ВТ_Грузополучатели.Контрагент), 0) КАК КоличествоСработавшихКлиентов
	|ИЗ
	|	ВТ_Грузополучатели КАК ВТ_Грузополучатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Контрагент
	|ПОМЕСТИТЬ ВТ_ГрузополучателиНачалоМесяца
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачалоМесяца И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ВТ_ГрузополучателиНачалоМесяца.Контрагент), 0) КАК КоличествоСработавшихКлиентовЗаМесяц
	|ИЗ
	|	ВТ_ГрузополучателиНачалоМесяца КАК ВТ_ГрузополучателиНачалоМесяца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслуг.Контрагент
	|ПОМЕСТИТЬ ВТ_ГрузополучателиНачалоГода
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачалоГода И &Дата2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(ВТ_ГрузополучателиНачалоГода.Контрагент), 0) КАК КоличествоСработавшихКлиентовЗаГод
	|ИЗ
	|	ВТ_ГрузополучателиНачалоГода КАК ВТ_ГрузополучателиНачалоГода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ПродажиОбороты.СтоимостьОборот ЕСТЬ NULL
	|				ТОГДА Служебная.НулевойОборот
	|			ИНАЧЕ ПродажиОбороты.СтоимостьОборот
	|		КОНЕЦ) КАК ОборотПоБрендуMILESРуб,
	|	СУММА(ВЫРАЗИТЬ(ВЫБОР
	|				КОГДА ЕСТЬNULL(КурсЕвро.Кратность, 0) > 0
	|						И ЕСТЬNULL(КурсЕвро.Курс, 0) > 0
	|					ТОГДА ВЫБОР
	|							КОГДА ПродажиОбороты.СтоимостьОборот ЕСТЬ NULL
	|								ТОГДА Служебная.НулевойОборот
	|							ИНАЧЕ ПродажиОбороты.СтоимостьОборот
	|						КОНЕЦ * КурсЕвро.Кратность / КурсЕвро.Курс
	|				ИНАЧЕ 0
	|			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК ОборотПоБрендуMILESЕвро
	|ИЗ
	|	(ВЫБРАТЬ
	|		0 КАК НулевойОборот) КАК Служебная
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
	|				&ДатаНачалоМесяца,
	|				&Дата2,
	|				Регистратор,
	|				Номенклатура.Родитель = &ГруппаMILES
	|					И ВЫБОР
	|						КОГДА &ФильтруемПоКонтрагентам
	|							ТОГДА НЕ Контрагент В (&СписокКонтрагентов)
	|						ИНАЧЕ ИСТИНА
	|					КОНЕЦ) КАК ПродажиОбороты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(, Валюта = &Евро) КАК КурсЕвро
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ПродажиОбороты.СтоимостьОборот ЕСТЬ NULL
	|				ТОГДА Служебная.НулевойОборот
	|			ИНАЧЕ ПродажиОбороты.СтоимостьОборот
	|		КОНЕЦ >= 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент
	|ПОМЕСТИТЬ ВТ_ГрузополучателиКупилиБрэндMILESЗаДень
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И РеализацияТоваровУслугТовары.Ссылка.Проведен
	|	И РеализацияТоваровУслугТовары.Номенклатура.Родитель = &ГруппаMILES
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВТ_ГрузополучателиКупилиБрэндMILESЗаДень.Контрагент) КАК ГрузополучателиКупилиБрэндMILESЗаДень
	|ИЗ
	|	ВТ_ГрузополучателиКупилиБрэндMILESЗаДень КАК ВТ_ГрузополучателиКупилиБрэндMILESЗаДень
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент
	|ПОМЕСТИТЬ ВТ_ГрузополучателиКупилиБрэндMILESЗаМесяц
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачалоМесяца И &Дата2
	|	И РеализацияТоваровУслугТовары.Ссылка.Проведен
	|	И РеализацияТоваровУслугТовары.Номенклатура.Родитель = &ГруппаMILES
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВТ_ГрузополучателиКупилиБрэндMILESЗаМесяц.Контрагент) КАК ГрузополучателиКупилиБрэндMILESЗаМесяц
	|ИЗ
	|	ВТ_ГрузополучателиКупилиБрэндMILESЗаМесяц КАК ВТ_ГрузополучателиКупилиБрэндMILESЗаМесяц
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Контрагент
	|ПОМЕСТИТЬ ВТ_ГрузополучателиКупилиБрэндMILESЗаГод
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	|ГДЕ
	|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНачалоГода И &Дата2
	|	И РеализацияТоваровУслугТовары.Ссылка.Проведен
	|	И РеализацияТоваровУслугТовары.Номенклатура.Родитель = &ГруппаMILES
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ВТ_ГрузополучателиКупилиБрэндMILESЗаГод.Контрагент) КАК ГрузополучателиКупилиБрэндMILESЗаГод
	|ИЗ
	|	ВТ_ГрузополучателиКупилиБрэндMILESЗаГод КАК ВТ_ГрузополучателиКупилиБрэндMILESЗаГод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток КАК ОбщаяДебиторскаяЗадолженностьКлиентов,
	|	ВзаиморасчетыСКонтрагентамиОстатки.ДоговорКонтрагента
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&Д, ДоговорКонтрагента.ВидДоговора = &ВидДоговора) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток КАК СуммаДолга,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности КАК ЧислоДнейЗадолженности,
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Дата КАК ДатаВозникновенияДолга
	|ПОМЕСТИТЬ ВТ_ДолгиПоНакладным
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
	|			&Д,
	|			ДоговорКонтрагента.ВидДоговора = &ВидДоговора
	|				И ДоговорКонтрагента.ВестиПоДокументамРасчетовСКонтрагентом
	|				И ДоговорКонтрагента.КонтролироватьЧислоДнейЗадолженности) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
	|ГДЕ
	|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДолгиПоНакладным.ДокументРасчетовСКонтрагентом,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(КОНЕЦПЕРИОДА(ВТ_ДолгиПоНакладным.ДатаВозникновенияДолга, ДЕНЬ), НАЧАЛОПЕРИОДА(&Д, ДЕНЬ), ДЕНЬ) > ВТ_ДолгиПоНакладным.ЧислоДнейЗадолженности
	|			ТОГДА ВТ_ДолгиПоНакладным.СуммаДолга
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Долг
	|ИЗ
	|	ВТ_ДолгиПоНакладным КАК ВТ_ДолгиПоНакладным
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка,
	|	КОЛИЧЕСТВО(СборкаЗаказовПокупателяЗаказано.НомерСтроки) КАК КоличествоСобрано
	|ПОМЕСТИТЬ ВТ_Сборки
	|ИЗ
	|	Документ.СборкаЗаказовПокупателя.Заказано КАК СборкаЗаказовПокупателяЗаказано
	|ГДЕ
	|	СборкаЗаказовПокупателяЗаказано.Ссылка.ВремяОкончанияСборки МЕЖДУ &Дата1 И &Дата2
	|	И СборкаЗаказовПокупателяЗаказано.Ссылка.Проведен
	|	И СборкаЗаказовПокупателяЗаказано.Ссылка.ДокументСобранИУпакован
	|
	|СГРУППИРОВАТЬ ПО
	|	СборкаЗаказовПокупателяЗаказано.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Сборки.КоличествоСобрано КАК КоличествоСтрокСобрано,
	|	ВТ_Сборки.Ссылка
	|ИЗ
	|	ВТ_Сборки КАК ВТ_Сборки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(КорректировкаСборкиЗаказовПокупателяТовары.НомерСтроки) КАК КоличествоСтрокКорректировкиСборки
	|ИЗ
	|	Документ.КорректировкаСборкиЗаказовПокупателя.Товары КАК КорректировкаСборкиЗаказовПокупателяТовары
	|ГДЕ
	|	КорректировкаСборкиЗаказовПокупателяТовары.Ссылка.Проведен
	|	И КорректировкаСборкиЗаказовПокупателяТовары.Ссылка.СборкаЗаказовПокупателя В
	|			(ВЫБРАТЬ
	|				ВТ_Сборки.Ссылка
	|			ИЗ
	|				ВТ_Сборки КАК ВТ_Сборки)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ЗаказПоставщикуТовары.НомерСтроки) КАК КоличествоСтрокВЗаказеПоставщику,
	|	ЗаказПоставщикуТовары.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка.Проведен
	|	И ЗаказПоставщикуТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Д", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("Склад", ОсновнойСклад);
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ДатаОтчета));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("Евро", Справочники.Валюты.НайтиПоКоду("978"));
	
	Запрос.УстановитьПараметр("ДатаНачалоМесяца", НачалоДня(НачалоМесяца(ДатаОтчета)));
	Запрос.УстановитьПараметр("ДатаНачалоГода", НачалоГода(НачалоМесяца(ДатаОтчета)));
	
	
	Запрос.УстановитьПараметр("Экспресс", Константы.ЯчейкаЭкспресс.Получить());
	Запрос.УстановитьПараметр("ЯчейкаДоВыяснения", Константы.ЯчейкаДоВыяснения.Получить());
	Запрос.УстановитьПараметр("ПустойОтветственный", Справочники.ФизическиеЛица.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("ГруппаMILES", Константы.ГруппаMILES.Получить());
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	Запрос.УстановитьПараметр("ПустойЗаказ", ""); 
	
	Если НЕ Интерактивно Тогда
		
		СтруктураНастройки = Новый Структура;
		СтруктураНастройки.Вставить("Пользователь", Справочники.Пользователи.НайтиПоКоду("webadmin"));
		СтруктураНастройки.Вставить("ИмяОбъекта", "ОтчетОбъект.ДневнойОтчет");	
		СтруктураНастройки.Вставить("НаименованиеНастройки", "ДневнойОтчетРегламентное");
		
		Если УниверсальныеМеханизмы.ПолучитьНастройку(СтруктураНастройки) Тогда 		
			
			ЭтотОбъект.мТекущаяНастройка = СтруктураНастройки;
			ВосстановитьНастройкиРегламентаИзСтруктуры(СтруктураНастройки.СохраненнаяНастройка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("СписокКонтрагентов", СписокКонтрагентов); 
	Запрос.УстановитьПараметр("ФильтруемПоКонтрагентам", НЕ СписокКонтрагентов.Количество() = 0); 
	
	Пакетник = Запрос.ВыполнитьПакет();
	
	Если Пакетник[0].Выгрузить().Количество() > 0 Тогда 
		ОстаткиНаКонецДня = Пакетник[0].Выгрузить()[0].КоличествоРазличныхАртикуловНаКонецДня;
	Иначе 
		ОстаткиНаКонецДня = 0;
	КонецЕсли;
	
	Если Пакетник[1].Выгрузить().Количество() > 0 Тогда 
		КоличествоСтрокПринятоПаллета = Пакетник[1].Выгрузить()[0].КоличествоПринятоПаллета;
	Иначе	
		КоличествоСтрокПринятоПаллета = 0;
	КонецЕсли;
	
	Если Пакетник[2].Выгрузить().Количество() > 0 Тогда 
		КоличествоСтрокПринятоНЕПаллета = Пакетник[2].Выгрузить()[0].КоличествоПринятоНЕПаллета;
	Иначе 
		КоличествоСтрокПринятоНЕПаллета = 0;
	КонецЕсли;
	
	Если Пакетник[3].Выгрузить().Количество() > 0 Тогда 
		КоличествоСтрокПеремещено = Пакетник[3].Выгрузить()[0].КоличествоСтрокПеремещено;
	Иначе 
		КоличествоСтрокПеремещено = 0;
	КонецЕсли;
	
	Если Пакетник[4].Выгрузить().Количество() > 0 Тогда 
		КоличествоНеСобрано = Пакетник[4].Выгрузить()[0].КоличествоНеСобрано;
	Иначе 
		КоличествоНеСобрано = 0;
	КонецЕсли;
	
	Если Пакетник[5].Выгрузить().Количество() > 0 Тогда 
		КоличествоСборокВЯчейку_ДоВыяснения = Пакетник[5].Выгрузить()[0].КоличествоСборокВЯчейку_ДоВыяснения;
	Иначе 
		КоличествоСборокВЯчейку_ДоВыяснения = 0;
	КонецЕсли;
	
	Если Пакетник[7].Выгрузить().Количество() > 0 Тогда 
		КоличествоРаботающихСотрудников = Пакетник[7].Выгрузить()[0].КоличествоОтветственных;
	Иначе 
		КоличествоРаботающихСотрудников = 0;
	КонецЕсли;
	
	Если Пакетник[25].Выгрузить().Количество() > 0 Тогда
		
		ТЗ_КоличествоСтрокСобрано = Пакетник[25].Выгрузить(); 
		КоличествоСтрокСобрано = ТЗ_КоличествоСтрокСобрано.Итог("КоличествоСтрокСобрано");
		
	Иначе 
		КоличествоСтрокСобрано = 0;
	КонецЕсли;
	
	ПринятоСобраноПеремещено = КоличествоСтрокСобрано + КоличествоСтрокПринятоНЕПаллета + КоличествоСтрокПринятоПаллета + КоличествоСтрокПеремещено;
	
	Если КоличествоРаботающихСотрудников = 0 Тогда 
		СредняяЭффективностьСотрудниковСклада = 0;
	Иначе 
		СредняяЭффективностьСотрудниковСклада = ПринятоСобраноПеремещено / КоличествоРаботающихСотрудников;
	КонецЕсли;
	
	Если Пакетник[9].Выгрузить().Количество() > 0 Тогда 
		КоличествоСработавшихКлиентов = Пакетник[9].Выгрузить()[0].КоличествоСработавшихКлиентов;
	Иначе 
		КоличествоСработавшихКлиентов = 0;
	КонецЕсли;
	
	Если Пакетник[11].Выгрузить().Количество() > 0 Тогда 
		КоличествоСработавшихКлиентовЗаТекущийМесяц = Пакетник[11].Выгрузить()[0].КоличествоСработавшихКлиентовЗаМесяц;
	Иначе 
		КоличествоСработавшихКлиентовЗаТекущийМесяц = 0;
	КонецЕсли;
	
	Если Пакетник[13].Выгрузить().Количество() > 0 Тогда 
		КоличествоСработавшихКлиентовЗаГод = Пакетник[13].Выгрузить()[0].КоличествоСработавшихКлиентовЗаГод;
	Иначе 
		КоличествоСработавшихКлиентовЗаГод = 0;
	КонецЕсли;
	
	ОборотПоБрендуMILES = Строка(Пакетник[14].Выгрузить()[0].ОборотПоБрендуMILESРуб) + " / " + Пакетник[14].Выгрузить()[0].ОборотПоБрендуMILESЕвро;
	
	Если Пакетник[16].Выгрузить().Количество() > 0 Тогда 
		ГрузополучателиКупилиБрэндMILESЗаДень = Пакетник[16].Выгрузить()[0].ГрузополучателиКупилиБрэндMILESЗаДень;
	Иначе 
		ГрузополучателиКупилиБрэндMILESЗаДень = 0;
	КонецЕсли;
	
	Если Пакетник[18].Выгрузить().Количество() > 0 Тогда 
		ГрузополучателиКупилиБрэндMILESЗаМесяц = Пакетник[18].Выгрузить()[0].ГрузополучателиКупилиБрэндMILESЗаМесяц;
	Иначе 
		ГрузополучателиКупилиБрэндMILESЗаМесяц = 0;
	КонецЕсли;
	
	Если Пакетник[20].Выгрузить().Количество() > 0 Тогда 
		ГрузополучателиКупилиБрэндMILESЗаГод = Пакетник[20].Выгрузить()[0].ГрузополучателиКупилиБрэндMILESЗаГод;
	Иначе 
		ГрузополучателиКупилиБрэндMILESЗаГод = 0;
	КонецЕсли;
	
	Если Пакетник[21].Выгрузить().Количество() > 0 Тогда 
		
		ТЗ_ОбщаяДебиторскаяЗадолженностьКлиентов = Пакетник[21].Выгрузить();
		ОбщаяДебиторскаяЗадолженностьКлиентов = ТЗ_ОбщаяДебиторскаяЗадолженностьКлиентов.Итог("ОбщаяДебиторскаяЗадолженностьКлиентов");
		
	Иначе 
		ОбщаяДебиторскаяЗадолженностьКлиентов = 0;
	КонецЕсли;
	
	Если Пакетник[23].Выгрузить().Количество() > 0 Тогда 
		
		ТЗ_ПросроченнаяЗадолженность = Пакетник[23].Выгрузить();
		ПросроченнаяДебиторскаяЗадолженность = ТЗ_ПросроченнаяЗадолженность.Итог("Долг");
		
	Иначе 
		ПросроченнаяДебиторскаяЗадолженность = 0;
	КонецЕсли;
	
	Если Пакетник[26].Выгрузить().Количество() > 0 Тогда 
		КоличествоСтрокКорректировкиСборки = Пакетник[26].Выгрузить()[0].КоличествоСтрокКорректировкиСборки;
	Иначе 
		КоличествоСтрокКорректировкиСборки = 0;
	КонецЕсли;
	
	КоличествоСтрокСобрано = КоличествоСтрокСобрано - КоличествоСтрокКорректировкиСборки;
	КоличествоСтрокВЗаказеПоставщику = 0;
	
	Если Пакетник[27].Выгрузить().Количество() > 0 Тогда 
		
		ТЗ_КоличествоСтрокВЗаказеПоставщику = Пакетник[27].Выгрузить(); 
		
		Для каждого ТекСтр Из ТЗ_КоличествоСтрокВЗаказеПоставщику Цикл
			
			Для каждого СчетчикСтрок Из ТекСтр.Ссылка.Товары Цикл
				
				Если НЕ ЗначениеЗаполнено(СчетчикСтрок.Заказ) Тогда 
					КоличествоСтрокВЗаказеПоставщику = КоличествоСтрокВЗаказеПоставщику + 1;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	// Получим таблицу с продажами и себестоимостью
	ТЗ_Валовка = ПолучитьТЗ(НачалоДня(НачалоДня(НачалоМесяца(ДатаОтчета))));
	ОборотЗаДень_RUB = 0;
	ОборотЗаДень_Евро = 0;
	ОборотЗаМесяц_RUB = 0;
	ОборотЗаМесяц_Евро = 0;
	
	ВаловаяПрибыльЗаДень_RUB = 0;
	ВаловаяПрибыльЗаДень_Евро = 0;
	ВаловаяПрибыльЗаМесяц_RUB = 0;
	ВаловаяПрибыльЗаМесяц_Евро = 0;
	
	Если ТЗ_Валовка.Количество()>0 Тогда 
		
		СтрокаТЗ = ТЗ_Валовка.Найти(НачалоДня(ДатаОтчета));
		
		Если СтрокаТЗ <> Неопределено Тогда 
			
			ОборотЗаДень_RUB = СтрокаТЗ.СуммаПродаж;
			ВаловаяПрибыльЗаДень_RUB = СтрокаТЗ.СуммаПродаж - СтрокаТЗ.СуммаСебестоимость;
			
			Если СтрокаТЗ.Курс <> 0 Тогда 
				
				ОборотЗаДень_Евро = СтрокаТЗ.СуммаПродаж / СтрокаТЗ.Курс;
				ВаловаяПрибыльЗаДень_Евро = (СтрокаТЗ.СуммаПродаж - СтрокаТЗ.СуммаСебестоимость)/СтрокаТЗ.Курс;
				
			КонецЕсли;
			
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("Месяц", Месяц(ДатаОтчета));
		
		Строки = ТЗ_Валовка.НайтиСтроки(СтруктураОтбора);
		
		Для каждого ТекСтр Из Строки Цикл
			
			ОборотЗаМесяц_RUB = ОборотЗаМесяц_RUB + ТекСтр.СуммаПродаж;
			ВаловаяПрибыльЗаМесяц_RUB = ВаловаяПрибыльЗаМесяц_RUB + (ТекСтр.СуммаПродаж- ТекСтр.СуммаСебестоимость);
			
			Если ТекСтр.Курс <> 0 Тогда
				ОборотЗаМесяц_Евро = ОборотЗаМесяц_Евро + ТекСтр.СуммаПродаж/ТекСтр.Курс;
				ВаловаяПрибыльЗаМесяц_Евро = ВаловаяПрибыльЗаМесяц_Евро + (ТекСтр.СуммаПродаж- ТекСтр.СуммаСебестоимость)/ ТекСтр.Курс;
			КонецЕсли;
			
			
		КонецЦикла; 
		
	КонецЕсли;
	
	Если ОборотЗаМесяц_Евро <> 0 Тогда 
		
		//Рентабельность_EUR = ВаловаяПрибыльЗаМесяц_RUB *100/ ОборотЗаМесяц_Евро;
		//		Рентабельность следует считать так
		//1. Оборот с начала месяца(EUR) - Валовая прибыть с начала месяца(EUR) – получили оборот по себестимости.
		//2. (Оборот с начала месяца(EUR) / Оборот по себестоимости – 1)*100 = - получили эффективность в %.
		//На нашем примере:
		//1. 43438 – 3418 = 40020 EUR
		//2. (43438/40020-1)*100 = 8.54% эффективность (наценка от себестоимости)
		
		ОборотПоСебестоимости = ОборотЗаМесяц_Евро - ВаловаяПрибыльЗаМесяц_Евро;
		Рентабельность_EUR = (ОборотЗаМесяц_Евро / ОборотПоСебестоимости-1)*100;
		
	Иначе 
		Рентабельность_EUR = 0;
	КонецЕсли;
	
	// В отлельный запрос выношу пункт № 9
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказыПоставщикамОстатки.Номенклатура,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.КоличествоОстаток
	|ПОМЕСТИТЬ Вт_1
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&Д, ЗаказПоставщику.Склад = &Склад) КАК ЗаказыПоставщикамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Заказ
	|ПОМЕСТИТЬ ВТ_2
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				Вт_1.ЗаказПоставщику
	|			ИЗ
	|				Вт_1 КАК Вт_1)
	|	И ЗаказПоставщикуТовары.Номенклатура В
	|			(ВЫБРАТЬ
	|				Вт_1.Номенклатура
	|			ИЗ
	|				Вт_1 КАК Вт_1)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_2.Номенклатура
	|ИЗ
	|	ВТ_2 КАК ВТ_2
	|ГДЕ
	|	ВТ_2.Заказ = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("Д", КонецДня(ДатаОтчета));
	Запрос.УстановитьПараметр("Склад", ОсновнойСклад);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	МассивСНужнойНоменклатурой = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивСНужнойНоменклатурой.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	// Получили массив нужной номенклатуры. Теперь определяем для неё СВОБОДНЫЙ остаток. И если он = 0 -> это то , что нужно!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК СвободныйОстаткок,
	|	ТоварыНаСкладахОстатки.Номенклатура
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&Д,
	|			Склад = &ОсновнойСклад
	|				И Номенклатура В (&МассивНоменклатуры)) КАК ТоварыНаСкладахОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&Д, Склад = &ОсновнойСклад) КАК ТоварыВРезервеНаСкладахОстатки
	|		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("Д", КонецДня(ДатаОтчета) );
	Запрос.УстановитьПараметр("ОсновнойСклад", ОсновнойСклад );
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивСНужнойНоменклатурой);
	
	ТаблицаСвободныхОстатков = Запрос.Выполнить().Выгрузить();
	Выборка = Результат.Выбрать();
	ЖдуРазъяснений = 0;
	
	Для Каждого ТекСтр из МассивСНужнойНоменклатурой Цикл 
		
		СтрокаТЗ = ТаблицаСвободныхОстатков.Найти(ТекСтр);
		
		Если СтрокаТЗ = Неопределено Тогда 
			ЖдуРазъяснений = ЖдуРазъяснений + 1;
		Иначе 
			
			Если СтрокаТЗ.СвободныйОстаткок = 0 Тогда 
				ЖдуРазъяснений = ЖдуРазъяснений + 1;	
			КонецЕсли;
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заг = "Данные на конец дня : " + Формат(ДатаОтчета, "ДФ = dd.MM.yyyy");
	
	ТабДок.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ОбластьМакета.Параметры.ОстаткиНаКонецДня = ОстаткиНаКонецДня;
	ОбластьМакета.Параметры.КоличествоСтрокПринятоНЕПаллета = КоличествоСтрокПринятоНЕПаллета;
	ОбластьМакета.Параметры.КоличествоСтрокПринятоПаллета = КоличествоСтрокПринятоПаллета;
	ОбластьМакета.Параметры.КоличествоСтрокПеремещено = КоличествоСтрокПеремещено;
	ОбластьМакета.Параметры.КоличествоНеСобрано = КоличествоНеСобрано;
	ОбластьМакета.Параметры.ПринятоСобраноПеремещено = ПринятоСобраноПеремещено;
	ОбластьМакета.Параметры.КоличествоСборокВЯчейку_ДоВыяснения = КоличествоСборокВЯчейку_ДоВыяснения;
	ОбластьМакета.Параметры.КоличествоРаботающихСотрудников = КоличествоРаботающихСотрудников;
	ОбластьМакета.Параметры.СредняяЭффективностьСотрудниковСклада = СредняяЭффективностьСотрудниковСклада;
	ОбластьМакета.Параметры.ОборотЗаДень_RUB = ОборотЗаДень_RUB;
	ОбластьМакета.Параметры.ОборотЗаДень_Евро = ОборотЗаДень_Евро;
	ОбластьМакета.Параметры.ОборотЗаМесяц_RUB = ОборотЗаМесяц_RUB;
	ОбластьМакета.Параметры.ОборотЗаМесяц_Евро = ОборотЗаМесяц_Евро;
	ОбластьМакета.Параметры.ВаловаяПрибыльЗаДень_RUB = ВаловаяПрибыльЗаДень_RUB;
	ОбластьМакета.Параметры.ВаловаяПрибыльЗаДень_Евро = ВаловаяПрибыльЗаДень_Евро;
	ОбластьМакета.Параметры.ВаловаяПрибыльЗаМесяц_RUB = ВаловаяПрибыльЗаМесяц_RUB;
	ОбластьМакета.Параметры.ВаловаяПрибыльЗаМесяц_Евро = ВаловаяПрибыльЗаМесяц_Евро;
	ОбластьМакета.Параметры.Рентабельность_EUR = Рентабельность_EUR;
	ОбластьМакета.Параметры.КоличествоСработавшихКлиентов = КоличествоСработавшихКлиентов;
	ОбластьМакета.Параметры.КоличествоСработавшихКлиентовЗаТекущийМесяц = КоличествоСработавшихКлиентовЗаТекущийМесяц;
	ОбластьМакета.Параметры.КоличествоСработавшихКлиентовЗаГод = КоличествоСработавшихКлиентовЗаГод;
	ОбластьМакета.Параметры.ОборотПоБрендуMILES = ОборотПоБрендуMILES;
	ОбластьМакета.Параметры.ГрузополучателиКупилиБрэндMILESЗаДень = ГрузополучателиКупилиБрэндMILESЗаДень;
	ОбластьМакета.Параметры.ГрузополучателиКупилиБрэндMILESЗаМесяц = ГрузополучателиКупилиБрэндMILESЗаМесяц;
	ОбластьМакета.Параметры.ГрузополучателиКупилиБрэндMILESЗаГод = ГрузополучателиКупилиБрэндMILESЗаГод;
	
	ОбластьМакета.Параметры.ЖдуРазъяснений = ЖдуРазъяснений;
	
	ОбластьМакета.Параметры.КоличествоСтрокСобрано = КоличествоСтрокСобрано;
	ОбластьМакета.Параметры.КоличествоСтрокВЗаказеПоставщику = КоличествоСтрокВЗаказеПоставщику;
	
	ТабДок.Вывести(ОбластьМакета);
	
	Если Интерактивно Тогда 
		ТабДок.Показать();
	КонецЕсли;
	
	Если ОтправлятьНаЭлектроннуюПочту И ТаблицаЭлектронныхАдресовДляОтправки.Количество() > 0 Тогда 
		
		ИмяТекущегоФайла = "ДневнойОтчетНа" + "_" + Формат(Год(ДатаОтчета), "ЧГ = 0") + "_" + Прав("0" + Месяц(ДатаОтчета), 2) + "_" + Прав("0" + День(ДатаОтчета), 2) + Перечисления.ТипыФайловРассылок.XLSx;		
		ИмяТекущегоФайла = СтрЗаменить(ИмяТекущегоФайла, ":", "_");
		ПолноеИмяФайла = КаталогВременныхФайлов() + ИмяТекущегоФайла;
		
		ТабДок.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX); 
		
		Для каждого ТекАдрес Из ТаблицаЭлектронныхАдресовДляОтправки Цикл
			
			Профиль = УправлениеЭлектроннойПочтой.ПолучитьИнтернетПочтовыйПрофиль(УчетнаяЗаписьЭлектроннойПочты);
			Почта = Новый ИнтернетПочта; 
			УдалосьПодключиться = Ложь;
			
			Попытка
				
				Почта.Подключиться(Профиль);
				УдалосьПодключиться = Истина;
				
			Исключение
				
				ТекстСообщения = "Не удалось подключиться к учетной записи электронной почты " + УчетнаяЗаписьЭлектроннойПочты;
				
				#Если Клиент Тогда
					ТекстЛога = ТекстЛога + Символы.ПС + " ERR: " + ТекстСообщения;
				#Иначе
					ЗаписьЖурналаРегистрации("РассылкаДневногоОтчета", УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
				#КонецЕсли 
				
			КонецПопытки;
			
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Тема = "Дневной отчет на " + Формат(ДатаОтчета, "ДФ = dd.MM.yyyy");
			Сообщение.Получатели.Добавить(ТекАдрес.АдресЭлектроннойПочтыПользователяДляРассылкиОтчета); 
			Сообщение.Отправитель = УчетнаяЗаписьЭлектроннойПочты.АдресЭлектроннойПочты;
			
			УспешноОтправленПоПочте = Ложь;
			
			Попытка
				
				Файл = Новый Файл(ПолноеИмяФайла);
				
				Если Файл.Существует() Тогда
					
					Сообщение.Вложения.Добавить(ПолноеИмяФайла);
					Почта.Послать(Сообщение);
					ТекстСообщения = "Отправлен дневной отчет на дату " + Формат(ДатаОтчета, "ДФ = dd.MM.yyyy") + " на адрес " + ТекАдрес.АдресЭлектроннойПочтыПользователяДляРассылкиОтчета;
					
					#Если Клиент Тогда
						Сообщить(ТекстСообщения);
					#Иначе
						ЗаписьЖурналаРегистрации("РассылкаДневногоОтчета", УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
					#КонецЕсли
					
				КонецЕсли;
				
			Исключение
				
				ТекстСообщения = "Не удалось отправить письмос дневной отчет на дату " + Формат(ДатаОтчета, "ДФ = dd.MM.yyyy") + " на адрес " + ТекАдрес.АдресЭлектроннойПочтыПользователяДляРассылкиОтчета;
				
				#Если Клиент Тогда
					Сообщить(ТекстСообщения);
				#Иначе
					ЗаписьЖурналаРегистрации("РассылкаДневногоОтчета", УровеньЖурналаРегистрации.Информация, , , ТекстСообщения);
				#КонецЕсли
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьТЗ(НачПериода)
	
	ТабДок = Новый ТабличныйДокумент;	
	
	СКД = ПолучитьМакет("ОборотыИВаловка");
	
	СКД.НастройкиПоУмолчанию.ПараметрыДанных.Элементы[0].Значение = НачПериода;
	СКД.НастройкиПоУмолчанию.ПараметрыДанных.Элементы[0].Использование = Истина;
	СКД.НастройкиПоУмолчанию.ПараметрыДанных.Элементы[1].Значение = КонецДня(ДатаОтчета); 
	СКД.НастройкиПоУмолчанию.ПараметрыДанных.Элементы[1].Использование = Истина;
	
	Если НЕ СписокКонтрагентов.Количество() = 0 Тогда
		
		СКД.НастройкиПоУмолчанию.ПараметрыДанных.Элементы[2].Значение = СписокКонтрагентов; 
		СКД.НастройкиПоУмолчанию.ПараметрыДанных.Элементы[2].Использование = Истина;
		НовыйФильтр = СКД.НастройкиПоУмолчанию.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйФильтр.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
		НовыйФильтр.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент"); 
		НовыйФильтр.ПравоеЗначение = СписокКонтрагентов;
		НовыйФильтр.Использование = Истина;
		
	КонецЕсли;
	
	КомпановщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпановщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	КомпановщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпановки = КомпановщикМакета.Выполнить(СКД, СКД.НастройкиПоУмолчанию, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпановкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпановкиДанных.Инициализировать(МакетКомпановки, , , Истина);
	
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпановкиДанных);
	
	Возврат ТЗ;
	
КонецФункции

Процедура ВосстановитьНастройкиРегламентаИзСтруктуры(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Свойство("СписокКонтрагентов", СписокКонтрагентов);
	
КонецПроцедуры

Процедура СохранитьНастройкиРегламентаВСтруктуру(СохраненнаяНастройка) Экспорт
	
	СохраненнаяНастройка.Вставить("СписокКонтрагентов", СписокКонтрагентов);
	
КонецПроцедуры
